import React from 'react';
import { Typography, Container} from '@mui/material';
import Paragraph from '../../../../features/Paragraph/Paragraph.jsx';

const IntroductionPage = () => {

    return (
        <Container className="page-container">
            <Typography variant="h1" gutterBottom>Вступ</Typography>
            <Paragraph>
                Локальне зберігання даних у веб-додатках виявляється надзвичайно важливим аспектом розробки, особливо в контексті веб-технологій. У багатьох випадках, зберігання даних на клієнтському боці може бути надзвичайно корисним, а навіть необхідним для досягнення бажаного функціоналу.
            </Paragraph>
            <Paragraph>
                Пам'ять клієнта дозволяє зберігати інформацію на довший термін, навіть після закриття браузера, або при переході між сторінками. Це відкриває безліч можливостей для зручності користувача та покращення продуктивності веб-додатка.
            </Paragraph>
            <Paragraph>
                <Typography component="span" sx={{ fontWeight: 600 }}>
                    WebStorage
                </Typography> - це механізм, який дозволяє зберігати дані на боці клієнта у вигляді пар ключ-значення. Ці дані зберігаються безпосередньо в браузері користувача і доступні лише на стороні клієнта. Що означає, що дані не передаються на сервер, і вони не впливають на безпеку чи обсяг трафіку мережі. Всі ці дані доступні в межах домену, з якого була відправлена сторінка, і вони залишаються доступними навіть після перезапуску браузера.
            </Paragraph>
        </Container>
    );
};

export default IntroductionPage;