import React from 'react';

const LocalStoragePage = () => {
    return (
        <div className="page-container">
            <h1>LocalStorage</h1>
            <p>
                <strong>LocalStorage</strong> - це один із механізмів WebStorage в JavaScript, який дозволяє зберігати дані на боці клієнта в браузері.
            </p>
            <p>
                Цей механізм дозволяє зберігати дані на довший термін, навіть після закриття браузера або перезавантаження сторінки. Дані, збережені в LocalStorage, залишаються доступними для JavaScript-коду на стороні клієнта і можуть використовуватися для зберігання інформації, яка має бути доступною при наступних відвідуваннях веб-сайту.
            </p>

            <h2>Особливості та можливості LocalStorage</h2>
            <ul>
                <li>
                    <strong>Постійність даних:</strong> Дані, збережені в LocalStorage, доступні назавжди або до їх видалення. Це робить його відмінним інструментом для зберігання налаштувань користувача, даних сесій, локальних кешів і багатьох інших типів інформації.
                </li>
                <li>
                    <strong>Обмеження обсягу:</strong> LocalStorage обмежений обсягом даних, які можна зберегти (зазвичай 5-10 МБ в залежності від браузера). Це обмеження слід враховувати при роботі з великими обсягами інформації.
                </li>
                <li>
                    <strong>Легкий доступ до даних:</strong> Дані в LocalStorage доступні через JavaScript API і можуть бути легко витягнуті, оновлені, видалені і перевірені з використанням простих команд.
                </li>
                <li>
                    <strong>Безпека і обмеження:</strong> Доступ до LocalStorage можливий лише для коду, який запущений на стороні клієнта в межах домену, з якого була завантажена сторінка. Це забезпечує обмежену видимість і захист даних від сторонніх джерел.
                </li>
            </ul>

            <h2>Приклади зберігання та витягування даних в LocalStorage</h2>
            <h3>Зберігання даних</h3>
            <pre>
        <code>
          {`
// Зберігання значення 'John' під ключем 'username'
localStorage.setItem('username', 'John');
          `}
        </code>
      </pre>

            <h3>Витягування даних</h3>
            <pre>
        <code>
          {`
// Витягування значення, збереженого під ключем 'username'
const username = localStorage.getItem('username');
console.log('Користувач:', username); // Виводить 'Користувач: John'
          `}
        </code>
      </pre>

            <h3>Видалення даних</h3>
            <pre>
        <code>
          {`
// Видалення значення, збереженого під ключем 'username'
localStorage.removeItem('username');
          `}
        </code>
      </pre>

            <h3>Очищення всіх даних</h3>
            <pre>
        <code>
          {`
// Очищення всіх даних в LocalStorage
localStorage.clear();
          `}
        </code>
      </pre>

            <div className='conclusion'>
                <h2>Висновок</h2>
                <p>
                    <strong>LocalStorage</strong> є потужним інструментом для роботи з даними на стороні клієнта, і його
                    використання дозволяє зберігати та витягувати інформацію відвідувачів веб-сайту, що робить його
                    корисним для багатьох сценаріїв веб-розробки.
                </p>
            </div>
        </div>
    );
};

export default LocalStoragePage;