import React from 'react';

const IntroductionPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                В світі JavaScript, рекурсія, конструктори та методи об'єкту є ключовими поняттями, які розширюють можливості мови та дозволяють розробникам елегантно та ефективно реалізовувати різноманітні завдання.
            </p>

            <h2>Рекурсія</h2>
            <p>
                Рекурсія — це техніка в програмуванні, коли функція викликає сама себе для розв'язання певного завдання чи обчислення значення. Рекурсивні функції можуть спрощувати складні задачі та полегшувати їх розуміння.
            </p>

            <h2>Конструктори</h2>
            <p>
                Конструктори є спеціальним типом функцій, призначених для створення та ініціалізації об'єктів. Вони використовуються для створення багаторазових шаблонів об'єктів, що спрощує роботу з об'єктами та полегшує їхнє використання в коді. Розглядання конструкторів розкриє перед нами можливості об'єктно-орієнтованого програмування в JavaScript.
            </p>

            <h2>Методи об'єкту</h2>
            <p>
                Методи об'єкту — це функції, які визначені всередині об'єкта і використовуються для виконання певних дій з даними цього об'єкта. Вони дозволяють інкапсулювати логіку, пов'язану з об'єктом, і роблять код більш організованим та зрозумілим.
            </p>

            <div className='conclusion'>
                <h2>Заключення</h2>
                <p>
                    Розглядаючи рекурсію, конструктори та методи об'єкту, ми розкриємо глибокі можливості мови та
                    навчимося використовувати ці концепції для розробки ефективних та структурованих програм.
                </p>
            </div>
        </div>
    );
};

export default IntroductionPage;