import React from 'react';

const ArithmeticOperatorsPage = () => {
    return (
        <div className="page-container">
            <h1>Арифметичні оператори та залишок від ділення</h1>
            <p>
                Арифметичні оператори є важливою частиною будь-якої мови програмування, включаючи JavaScript. Вони дозволяють виконувати різноманітні обчислення та операції з числами. Тут ми детально розглянемо арифметичні оператори та особливості роботи з залишком від ділення (оператор <code>%</code>).
            </p>

            <h2>Арифметичні оператори</h2>
            <p>
                JavaScript підтримує різні арифметичні оператори, які можуть бути використані для виконання математичних обчислень. Основні арифметичні оператори включають:
            </p>
            <ul>
                <li><code>+</code> (додавання)</li>
                <li><code>-</code> (віднімання)</li>
                <li><code>*</code> (множення)</li>
                <li><code>/</code> (ділення)</li>
                <li><code>%</code> (залишок від ділення)</li>
            </ul>
            <p>Ось приклади використання цих операторів:</p>
            <pre>
        <code>
          {`
let a = 10;
let b = 5;

let sum = a + b; // Результат: 15
let difference = a - b; // Результат: 5
let product = a * b; // Результат: 50
let quotient = a / b; // Результат: 2
          `}
        </code>
      </pre>

            <h2>Залишок від ділення</h2>
            <p>
                Залишок від ділення (або модуль, чи остача) - це число, яке залишається після цілочисельного ділення одного числа на інше. У JavaScript для обчислення залишку від ділення використовується оператор <code>%</code>.
            </p>
            <pre>
        <code>
          {`
let a = 10;
let b = 3;

let remainder = a % b; // Результат: 1
          `}
        </code>
      </pre>
            <p>
                В цьому прикладі, змінна <code>remainder</code> буде мати значення <code>1</code>, оскільки при діленні <code>10</code> на <code>3</code> отримуємо максимально можливе число цілих трійок у десяти, яке дорівнює <code>3</code> (<code>3 * 3 = 9</code>), і залишок <code>1</code>, який не ділиться націло на <code>3</code>.
            </p>
            <p>
                Залишок від ділення може бути корисним у великому спектрі завдань, таких як визначення парних або непарних чисел, перевірка кратності тощо.
            </p>
        </div>
    );
};

export default ArithmeticOperatorsPage;