import React from 'react';

const RegularExpressions = () => {
    return (
        <div className="page-container">
            <h1>Що таке регулярні вирази?</h1>
            <p>
                Регулярні вирази - це шаблони, які використовуються для пошуку, визначення і вилучення текстових даних, які відповідають певним правилам. Вони дозволяють виразити складні умови для пошуку текстових відповідностей. Наприклад, ви можете використовувати регулярні вирази для пошуку адрес електронної пошти, номерів телефонів, URL-адрес або будь-якого іншого тексту.
            </p>

            <h2>Створення регулярних виразів у JavaScript</h2>
            <p>
                В JavaScript, ви можете створити регулярний вираз, використовуючи об'єкт <code>RegExp</code> або літеральний запис. Ось приклад створення простого регулярного виразу для пошуку слова "Hello" у тексті:
            </p>
            <pre>
                <code>
                    {`
// За допомогою літерального запису
const regex = /Hello/;

// Або за допомогою конструктора RegExp
const regex = new RegExp("Hello");
                    `}
                </code>
            </pre>

            <h2>Використання регулярних виразів</h2>
            <p>
                Після створення регулярного виразу, ви можете використовувати його для пошуку в тексті за допомогою методу <code>.test()</code>. Наприклад:
            </p>
            <pre>
                <code>
                    {`
const regex = /Hello/;
const text = "Hello, World!";
const result = regex.test(text);
console.log(result); // Виведе true, так як "Hello" знайдено у тексті.
                    `}
                </code>
            </pre>
        </div>
    );
};

export default RegularExpressions;