import React from 'react';

const OOPPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                На початковому етапі цього заняття ми обговоримо основні принципи Об'єктно-орієнтованого програмування, такі як інкапсуляція, поліморфізм та абстракція. Ці концепції допоможуть вам створювати більш структуровані та підтримувані програми, а також робити код більш зрозумілим для інших розробників.
            </p>

            <h2>Гетери та Сетери</h2>
            <p>
                Важливою частиною буде обговорення Геттерів та Сетерів, які дозволяють нам керувати доступом до властивостей об'єктів і забезпечують контроль над читанням та записом даних. Ми розглянемо, як створювати ці функції та де вони особливо корисні в розробці.
            </p>

            <h2>Прототипи</h2>
            <p>
                Ну і дуже дуже важлива частина заняття, це Прототипи. В JavaScript прототипи відіграють ключову роль у спадкуванні та розділі властивостей та методів між об'єктами. Ми докладно розглянемо, як працюють прототипи, як створювати спадкування та розширення функціональності через прототипи.
            </p>
        </div>
    );
};

export default OOPPage;