import React from 'react';

const LoopsIntroductionPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                У цій темі ми поглиблено вивчимо основні конструкції, які дозволяють керувати повторюваними діями в JavaScript. Ми розглянемо різні види циклів, включаючи цикли <code>while</code>, <code>do while</code> та <code>for</code>. Дізнаємося, як правильно їх використовувати та в чому полягають їх особливості.
            </p>
            <p>
                Окремо розглянемо цикли <code>for...in</code> та <code>for...of</code>, які дозволяють обходити елементи об'єктів та масивів. Ми також вивчимо ключові слова <code>break</code> та <code>continue</code>, які допомагають контролювати виконання циклів.
            </p>
            <p>
                Важливою частиною цієї теми буде вивчення вкладених циклів, коли один цикл розташований всередині іншого. Ми розглянемо ситуації, коли це необхідно для вирішення складних завдань.
            </p>
            <p>
                Завершимо тему, розглядаючи поняття нескінченних циклів та способи уникнення їх виникнення. Ця тема допоможе вам зрозуміти роботу циклів в JavaScript та використовувати їх для ефективної обробки даних та вирішення завдань в програмному коді.
            </p>
        </div>
    );
};

export default LoopsIntroductionPage;