import React from 'react';

const IntroductionPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                Локальне зберігання даних у веб-додатках виявляється надзвичайно важливим аспектом розробки, особливо в контексті веб-технологій. У багатьох випадках, зберігання даних на клієнтському боці може бути надзвичайно корисним, а навіть необхідним для досягнення бажаного функціоналу.
            </p>
            <p>
                Пам'ять клієнта дозволяє зберігати інформацію на довший термін, навіть після закриття браузера, або при переході між сторінками. Це відкриває безліч можливостей для зручності користувача та покращення продуктивності веб-додатка.
            </p>
            <p>
                <strong>WebStorage</strong> - це механізм, який дозволяє зберігати дані на боці клієнта у вигляді пар ключ-значення. Ці дані зберігаються безпосередньо в браузері користувача і доступні лише на стороні клієнта. Що означає, що дані не передаються на сервер, і вони не впливають на безпеку чи обсяг трафіку мережі. Всі ці дані доступні в межах домену, з якого була відправлена сторінка, і вони залишаються доступними навіть після перезапуску браузера.
            </p>
        </div>
    );
};

export default IntroductionPage;