import React from 'react';

const ArraysVsObjectsPage = () => {
    return (
        <div>
            <h1>Схожості та Різниці між Масивами та Об'єктами</h1>

            <p>
                Масиви (Array) та об'єкти (Object) - це дві основні структури даних в JavaScript, і вони мають свої схожості та різниці.
            </p>

            <h2>Схожості:</h2>
            <ul>
                <li><strong>Зберігання даних:</strong> Обидві структури призначені для зберігання даних. Вони можуть містити значення різних типів, такі як числа, рядки, булеві значення та інші.</li>
                <li><strong>Доступ за ключем або індексом:</strong> В обох випадках ви можете отримувати доступ до елементів за ключем або індексом.</li>
                <li><strong>Ітерація:</strong> Масиви та об'єкти піддаються ітерації, тобто ви можете перебирати їх елементи за допомогою циклів, таких як for або методів, таких як forEach.</li>
            </ul>

            <h2>Різниці:</h2>
            <ul>
                <li><strong>Внутрішнє уявлення:</strong> Масиви внутрішньо реалізовані як об'єкти, але з додатковими функціями та методами, які дозволяють працювати з ними як із послідовною колекцією значень.</li>
                <li><strong>Індексація:</strong> Масиви використовують числові індекси для доступу до елементів та зберігають їх в порядку, визначеному цими індексами. Об'єкти використовують ключі (рядки) та не гарантують жодного певного порядку для їхніх властивостей.</li>
                <li><strong>Методи та властивості:</strong> Масиви мають власні методи та властивості для роботи зі списками даних, такі як push, pop, shift, unshift, splice, length та інші. Об'єкти не мають таких методів. Ви зазвичай використовуєте звичайні операції додавання, зміни та видалення властивостей.</li>
            </ul>

            <h2>Приклади:</h2>
            <h3>Масив</h3>
            <pre>
        {`// Масив
const arr = [1, 2, 3];
console.log(arr[0]); // Доступ за індексом
arr.push(4); // Додавання елементу
console.log(arr.length); // Властивість "length"`}
      </pre>

            <h3>Об'єкт</h3>
            <pre>
        {`// Об'єкт
const obj = { key1: 1, key2: 2, key3: 3 };
console.log(obj['key1']); // Доступ за ключем
obj.newKey = 'значення'; // Додавання ключа`}
      </pre>

            <h2>Робота з typeof в масивах та об'єктах:</h2>
            <pre>
        {`const arr = [1, 2, 3];
const obj = { key1: 1, key2: 2, key3: 3 };

console.log(typeof arr); // "object" - масив вважається об'єктом
console.log(typeof obj); // "object" - об'єкт також вважається об'єктом`}
      </pre>

            <p>
                Інструкція <code>typeof</code> виведе "object" для як масивів, так і об'єктів, оскільки вони є об'єктами в JavaScript. Щоб розрізнити масиви та об'єкти, ви можете скористатися іншими методами, такими як <code>Array.isArray()</code>:
            </p>
            <pre>
        {`console.log(Array.isArray(arr)); // true - перевіряємо, чи це масив
console.log(Array.isArray(obj)); // false - об'єкт не є масивом`}
      </pre>

            <p>
                Цей спосіб допомагає вам точно визначити, чи об'єкт є масивом чи ні.
            </p>
        </div>
    );
}

export default ArraysVsObjectsPage;
