import React from 'react';

const PureFunctionsPage = () => {
    return (
        <div className="page-container">
            <h1>Чисті функції</h1>
            <p>
                Чисті функції є фундаментальним поняттям в програмуванні, особливо в JavaScript. Це функції, які мають певні властивості, спрощуючи розробку, розуміння і тестування коду.
            </p>
            <p>
                Використовуючи чисті функції, можна забезпечити більшу стабільність, легкість розуміння і підтримки коду, що робить їх важливою концепцією в розробці програмного забезпечення.
            </p>

            <h2>Основні характеристики чистих функцій</h2>
            <p>
                Ось основні характеристики чистих функцій:
            </p>

            <h3>1. Детермінованість</h3>
            <p>
                Чиста функція завжди повертає однаковий результат для однакових вхідних даних. Немає впливу зовнішнього стану або змінних.
            </p>
            <pre>
        <code>
          {`
function add(a, b) {
  return a + b;
}
          `}
        </code>
      </pre>

            <h3>2. Без побічних ефектів</h3>
            <p>
                Це означає, що чиста функція не змінює стану програми і не виконує операцій, які впливають на зовнішнє середовище. Вона лише обчислює результат і повертає його.
            </p>
            <pre>
        <code>
          {`
let x = 10;

function double(n) {
  return n * 2;
}

let result = double(x); // result = 20, x не змінюється
          `}
        </code>
      </pre>

            <h3>3. Без побічних ефектів вводу-виводу</h3>
            <p>
                Чисті функції не залежать від зовнішніх джерел даних, таких як файли, мережа або консольний вивід.
            </p>
            <pre>
        <code>
          {`
function fetchData() {
  // Ця функція не є чистою, оскільки залежить від зовнішнього ресурсу
  return fetch('https://example.com/data.json').then(response => response.json());
}
          `}
        </code>
      </pre>

            <h3>4. Незалежність від порядку</h3>
            <p>
                Результат виконання чистої функції не залежить від порядку виклику функцій або інших операцій у програмі.
            </p>
            <pre>
        <code>
          {`
function add(a, b) {
  return a + b;
}

let sum1 = add(2, 3); // sum1 = 5
let sum2 = add(3, 2); // sum2 = 5, порядок не має значення
          `}
        </code>
      </pre>

            <h3>5. Чудова тестируваність</h3>
            <p>
                Чисті функції легше тестувати, оскільки їх результати передбачувані та не залежать від зовнішніх умов.
            </p>
            <pre>
        <code>
          {`
function isEven(number) {
  return number % 2 === 0;
}

console.log(isEven(4)); // true
console.log(isEven(7)); // false
          `}
        </code>
      </pre>
        </div>
    );
};

export default PureFunctionsPage;