import React from 'react';

const ControlFlowPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                Ми глибоко розглянемо основні засоби керування програмним потоком та обробки даних в мові програмування JavaScript. Почнемо з розгляду спливу змінних (hoisting), що дозволяє розуміти, як JavaScript обробляє змінні та функції під час виконання коду.
            </p>
            <p>
                Далі ви дізнаєтеся про правила та порядок виконання операторів, включаючи арифметичні операції, оператори присвоєння, інкремент та декремент, а також операції для роботи зі залишком від ділення. Ці знання стануть фундаментом для ефективної роботи з числовими значеннями в JavaScript.
            </p>
            <p>
                Ми також вивчимо бінарні та логічні оператори, такі як & (AND), | (OR), && (логічне AND), || (логічне OR), ?? (оператор злиття nullish), і дізнаємося, як вони застосовуються для створення умов та контролю логіки програми.
            </p>
            <p>
                Завершимо тему, розглядаючи тернарний оператор та роботу з умовними конструкціями if/else if/else та switch/case, що дозволять створювати гнучкі умови в вашому JavaScript-коді. Ця тема допоможе вам вдосконалити навички розробки та оптимізації програмного коду в JavaScript.
            </p>
        </div>
    );
};

export default ControlFlowPage;