import React from 'react';

const ClassesPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                JavaScript, з введенням стандарту ECMAScript 2015 (ES6), отримав потужний інструмент - класи. Це відносно новий підхід до створення та управління об'єктами в JS.
            </p>
            <p>
                Класи дозволяють вам організовувати свій код більш структуровано та ефективно, надаючи можливості для створення об'єктів, визначення властивостей та методів, а також реалізацію концепцій об'єктно-орієнтованого програмування (ООП).
            </p>
            <p>
                У цьому конспекті ми розглянемо основні концепції класів в JavaScript, вивчимо створення та використання класів, а також дослідимо їхні переваги в розробці програм на цій мові. Приготуйтеся долучитися до захоплюючого світу об'єктно-орієнтованого програмування у JavaScript!
            </p>
        </div>
    );
};

export default ClassesPage;