import React from 'react';

const FunctionVariantsPage = () => {
    return (
        <div className="page-container">
            <h1>Варіанти створення функцій</h1>
            <p>
                JavaScript пропонує багато способів роботи з функціями. Ми розглянемо вирази функцій, які дозволяють оголошувати функції динамічно, об'єкт <code>Function</code> для їх створення, стрілкові функції, які спрощують синтаксис, функції вищого порядку для більш гнучкого коду та функції-колбек для асинхронного програмування. Ознайомимось із цими концепціями для розширення можливостей JavaScript.
            </p>

            <h2>Вирази функцій</h2>
            <p>
                Одним із способів оголошення функцій є використання виразів функцій. Вони можуть зберігатися у змінних і викликатися пізніше. Ось приклад:
            </p>
            <pre>
        <code>
          {`
const mathPlus = function(a, b) {
    return a + b;
};

const result = mathPlus(3, 5); // результат отримає значення 8
          `}
        </code>
      </pre>
            <p>
                Вирази функцій особливо корисні, коли функція є анонімною і використовується як аргумент для іншої функції.
            </p>

            <h2>Анонімні функції</h2>
            <p>
                Анонімні функції в JavaScript - це функції, які не мають імені або імені змінної і є одноразовими або невеликими. Вони корисні для виконання одноразових завдань, створення функцій-колбеків або для захоплення змінних у замиканні. Ось деякі приклади використання анонімних функцій:
            </p>
            <h3>Як функція-колбек:</h3>
            <pre>
        <code>
          {`
const numbers = [1, 2, 3, 4, 5];
const squared = numbers.map(function(x) {
    return x * x;
});
          `}
        </code>
      </pre>
            <h3>Анонімна функція, передана як аргумент:</h3>
            <pre>
        <code>
          {`
setTimeout(function() {
    console.log("Ця функція викликається через 2 секунди");
}, 2000);
          `}
        </code>
      </pre>
            <h3>Анонімна функція, яка викликається сама:</h3>
            <pre>
        <code>
          {`
(function() {
    console.log("Ця функція викликається автоматично.");
})();
          `}
        </code>
      </pre>
            <h3>Замикання:</h3>
            <pre>
        <code>
          {`
function createCounter() {
    let count = 0;
    return function() {
        count++;
        console.log(count);
    };
}

const increment = createCounter();
increment(); // 1
increment(); // 2
          `}
        </code>
      </pre>
            <p>
                Анонімні функції дозволяють визначити та викликати функції без необхідності давати їм ім'я або прив'язувати їх до змінних. Це особливо корисно для оптимізації коду, коли функція використовується лише один раз.
            </p>

            <h2>Об'єкт Function</h2>
            <p>
                Функції є об'єктами в JavaScript, і об'єкт <code>Function</code> є конструктором для створення функцій. Він може бути використаний для динамічного створення функцій. Ось приклад:
            </p>
            <pre>
        <code>
          {`
const func = new Function('a', 'b', 'return a + b');
const result = func(3, 5); // результат отримає значення 8
          `}
        </code>
      </pre>
            <p>
                Не досвідчених розробників такий код може довести до істерики та бажання кинути навчання. Але не варто панікувати, на практиці, адекватні люди таке не пишуть. Бо цей підхід менш звичний. Нам він просто показує, що функції в JavaScript є об'єктами першого класу.
            </p>

            <h2>Стрілкові функції</h2>
            <p>
                Стрілкові функції - це спрощена синтаксична форма визначення функцій. Вони особливо корисні для визначення коротких функцій. Ось приклад:
            </p>
            <pre>
        <code>
          {`
const arrowMathPlus = (a, b) => a + b;
const result = arrowMathPlus(3, 5); // результат отримає значення 8
          `}
        </code>
      </pre>
            <p>
                Стрілкові функції не мають свого контексту <code>this</code>, що робить їх зручними для використання в об'єктно-орієнтованому програмуванні.
            </p>

            <h2>Функції вищого порядку</h2>
            <p>
                Функції вищого порядку - це функції, які приймають інші функції як аргументи або повертають їх як результат. Вони розширюють можливості функцій в JavaScript і сприяють створенню більш гнучких програм. Ось приклад використання функції вищого порядку <code>map</code>:
            </p>
            <pre>
        <code>
          {`
const arrayOfNumbers = [1, 2, 3, 4, 5];
const result = arrayOfNumbers.map(x => x * 2); // результат містить [2, 4, 6, 8, 10]
          `}
        </code>
      </pre>

            <h2>Функція-колбек</h2>
            <p>
                Функції-колбек - це функції, які передаються як аргументи іншим функціям і викликаються пізніше, коли виконання головної функції досягає точки виклику. Вони широко використовуються в асинхронному програмуванні. Ось приклад:
            </p>
            <pre>
        <code>
          {`
function callAfterTimeout(callback, delay) {
    setTimeout(callback, delay);
}

callAfterTimeout(() => {
    console.log("Ця функція виконається після затримки.");
}, 1000);
          `}
        </code>
      </pre>
            <p>
                Ця функція приймає іншу функцію (функцію-колбек) і виконує її після зазначеної затримки.
            </p>
        </div>
    );
};

export default FunctionVariantsPage;