import React from 'react';

const AsynchronyIntroductionPage = () => {
    return (
        <div className="page-container">
            <h1>Введення в асинхронність</h1>
            <p>
                Асинхронність в JavaScript є ключовим аспектом, який розширює можливості мови та дозволяє створювати більш ефективні та відзивчиві додатки. Давайте розглянемо основні поняття синхронного та асинхронного коду, а також дослідимо, чому асинхронність є необхідною для розвитку сучасних веб-додатків на JavaScript.
            </p>

            <h2>Синхронний та асинхронний код</h2>
            <p>
                <strong>Синхронний код</strong> виконується послідовно, операція за операцією. Кожен блокуючий виклик чекає завершення попереднього, що може призводити до зупинки виконання.
            </p>
            <pre>
        <code>
          {`
console.log('1');
console.log('2');
console.log('3');
          `}
        </code>
      </pre>
            <p>
                У вищенаведеному коді <code>2</code> та <code>3</code> виведуться в консоль лише після того, як виведеться <code>1</code>.
            </p>

            <p>
                <strong>Асинхронний код</strong> виконується паралельно, без очікування завершення попередніх операцій.
            </p>
            <pre>
        <code>
          {`
console.log('1');

setTimeout(() => {
    console.log('2');
}, 1000);

console.log('3');
          `}
        </code>
      </pre>
            <p>
                У цьому прикладі <code>2</code> виведеться через секунду, а <code>3</code> виведеться без очікування завершення <code>setTimeout</code>.
            </p>

            <h2>Важливість асинхронності для JavaScript</h2>
            <p>
                Асинхронність є важливою для JavaScript через такі аспекти:
            </p>
            <ul>
                <li>
                    <strong>Завантаження ресурсів:</strong> Асинхронне завантаження зображень, стилів, та інших ресурсів дозволяє не блокувати виконання коду, забезпечуючи швидше завантаження сторінки.
                </li>
                <li>
                    <strong>Робота з сервером:</strong> Асинхронні запити на сервер (за допомогою AJAX або Fetch API) дозволяють отримувати та відправляти дані без зупинки виконання інших операцій.
                </li>
                <li>
                    <strong>Запуск функцій у фоновому режимі:</strong> Використання Web Workers для виконання функцій в окремому потоці, не впливаючи на виконання основного коду.
                </li>
                <li>
                    <strong>Очікування подій:</strong> Асинхронна обробка подій дозволяє реагувати на користувацькі взаємодії без зупинки програми.
                </li>
                <li>
                    <strong>Паралельність операцій:</strong> Виконання багатьох завдань паралельно підвищує ефективність програм та забезпечує гладку роботу інтерфейсу.
                </li>
            </ul>

            <div className='conclusion'><h2>Заключення</h2>
                <p>
                    Асинхронність є важливим механізмом у JavaScript, який дозволяє створювати ефективні та відзивчиві
                    додатки. Використання асинхронного коду дозволяє уникнути блокування головного потоку, забезпечити
                    швидке завантаження ресурсів та ефективну обробку подій. Це робить JavaScript ідеальним інструментом
                    для розробки сучасних веб-додатків.
                </p></div>
        </div>
    );
};

export default AsynchronyIntroductionPage;