import React from 'react';

const JQueryOverviewPage = () => {
    return (
        <div className="page-container">
            <h1>Огляд бібліотеки jQuery</h1>

            <p>
                jQuery — це одна з найпопулярніших бібліотек JavaScript, яка значно спрощує роботу з DOM, обробку подій, створення анімацій та виконання AJAX-запитів. Створена Джоном Резігом у 2006 році, вона швидко здобула популярність завдяки своїй простоті та зручності. jQuery дозволяє розробникам писати менше коду, надаючи потужний та уніфікований API, який працює однаково добре в різних браузерах.
            </p>

            <p>
                Незважаючи на появу сучасних фреймворків, таких як React чи Vue.js, jQuery залишається актуальною для підтримки старих проектів або швидкого вирішення простих завдань. Її мінімалістичний підхід та велика спільнота роблять її ідеальним інструментом для тих, хто шукає простий та ефективний спосіб роботи з веб-сторінками.
            </p>
        </div>
    );
};

export default JQueryOverviewPage;