import React from 'react';

const IntroductionPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                Спливання подій - це важливий механізм в JavaScript, який впливає на те, як події поширюються в DOM-дереві. Ми докладно вивчимо, як цей механізм працює, і як його використовувати для ефективної обробки подій.
            </p>
            <p>
                Делегування подій - це техніка, яка дозволяє вам оптимізувати роботу з багатьма елементами DOM та ефективно відслідковувати події на динамічно створених елементах. Ми розглянемо, як використовувати цю техніку для покращення користувацького інтерфейсу ваших додатків.
            </p>
            <p>
                Браузерний об'єктний об'єкт (BOM) - дозволяє взаємодіяти з вікном браузера та керувати різними аспектами сторінки. Ми докладно розглянемо об'єкт <code>window</code> та його властивості та методи, які вам допоможуть керувати вікном браузера та URL.
            </p>
        </div>
    );
};

export default IntroductionPage;