import React from 'react';

const FormValidationAttributes = () => {
    return (
        <div className="page-container">
            <h1>Використання атрибутів required, pattern та інших для валідації введених даних в формах HTML</h1>
            <p>
                У формах HTML існує кілька атрибутів, які дозволяють валідувати дані, які вводять користувачі. Ці атрибути полегшують роботу і покращують користувацький досвід, дозволяючи перевіряти введені дані ще до їх відправлення на сервер. Ось кілька атрибутів та приклади їх використання:
            </p>

            <h2>1. required</h2>
            <p>
                Цей атрибут вказує, що поле обов'язкове для заповнення. Якщо воно залишене порожнім, форма не буде відправлена.
            </p>
            <pre>
                <code>
                    {`
<input type="text" required>
                    `}
                </code>
            </pre>

            <h2>2. pattern</h2>
            <p>
                Цей атрибут визначає шаблон, якому повинні відповідати введені дані. Наприклад, для перевірки правильності введення електронної пошти:
            </p>
            <pre>
                <code>
                    {`
<input type="email" pattern="[a-z0-9._%+-]+@[a-z0-9.-]+\\.[a-z]{2,4}" required>
                    `}
                </code>
            </pre>

            <h2>3. min та max</h2>
            <p>
                Встановлення мінімального і максимального допустимого значення для числових полів.
            </p>
            <pre>
                <code>
                    {`
<input type="number" min="0" max="100">
                    `}
                </code>
            </pre>

            <h2>4. minlength та maxlength</h2>
            <p>
                Встановлення мінімальної та максимальної кількості символів для текстових полів.
            </p>
            <pre>
                <code>
                    {`
<input type="text" minlength="3" maxlength="20">
                    `}
                </code>
            </pre>

            <h2>5. pattern з виразами</h2>
            <p>
                Ви можете використовувати регулярні вирази для визначення прийнятних значень.
            </p>
            <pre>
                <code>
                    {`
<input type="text" pattern="[0-9]{5}" title="П'ять цифр">
                    `}
                </code>
            </pre>

            <div className='conclusion'>
                <h2>Висновок</h2>
                <p>
                    Ці атрибути спільно допомагають забезпечити, що користувачі вводять валідні дані. У разі
                    невідповідності, браузер відобразить повідомлення про помилку і не дозволить надсилати форму. Це
                    покращує користувацький досвід і допомагає уникнути некоректних або небезпечних даних, що
                    потрапляють на сервер.
                </p>
            </div>
        </div>
    );
};

export default FormValidationAttributes;