import React from 'react';
import './TermsOfService.css'

const TermsOfServicePage = () => {
    return (
        <div className="page-container">
            <h1>Правила сервісу</h1>

            <p>
                Ласкаво просимо на наш сервіс! Будь ласка, уважно ознайомтеся з цими правилами перед використанням нашого веб-сайту. Використовуючи наш сервіс, ви погоджуєтеся дотримуватися цих правил.
            </p>

            <h2>1. Використання сервісу</h2>
            <p>
                Наш сервіс надається для особистого та некомерційного використання. Ви можете використовувати наші матеріали та інструменти для навчання, розробки та інших законних цілей, але заборонено:
            </p>
            <ul>
                <li>Використовувати сервіс для незаконних або шкідливих дій.</li>
                <li>Копіювати, розповсюджувати або використовувати матеріали без дозволу.</li>
                <li>Спроби порушення роботи сервісу або отримання несанкціонованого доступу до систем.</li>
            </ul>
            <p>
                При використанні контенту з нашого сервісу обов'язково вказуйте посилання на наш сайт як джерело.
            </p>

            <h2>2. Контент та авторські права</h2>
            <p>
                Весь контент на нашому сайті (тексти, зображення, код тощо) захищений авторськими правами. Ви можете використовувати цей контент лише для особистого використання. Будь-яке інше використання потребує письмового дозволу від нас.
            </p>

            <h2>3. Відмова від відповідальності</h2>
            <p>
                Ми намагаємося забезпечити точність та актуальність інформації на нашому сайті, але не гарантуємо її повної достовірності. Використовуючи наш сервіс, ви погоджуєтеся, що ми не несемо відповідальності за будь-які збитки або втрати, пов'язані з використанням нашого сайту.
            </p>

            <h2>4. Зміни правил</h2>
            <p>
                Ми можемо періодично оновлювати ці правила. Будь ласка, періодично переглядайте цю сторінку, щоб бути в курсі будь-яких змін. Продовжуючи використовувати наш сервіс після змін, ви погоджуєтеся з оновленими правилами.
            </p>

            <h2>5. Зв'язок з нами</h2>
            <p>
                Якщо у вас є питання щодо цих правил, будь ласка, зв'яжіться з нами через електронну пошту на страниці <a href="../Contact/Contact.jsx">Contact</a>.
            </p>
        </div>
    );
};

export default TermsOfServicePage;