import React from 'react';
import './PrivatPolicy.css'

const PrivacyPolicyPage = () => {
    return (
        <div className="page-container">
            <h1>Політика конфіденційності</h1>

            <p>
                Ваша конфіденційність дуже важлива для нас. Ця політика конфіденційності описує, як ми збираємо, використовуємо та захищаємо вашу особисту інформацію під час використання нашого веб-сайту.
            </p>

            <h2>Яку інформацію ми збираємо?</h2>
            <p>
                Ми можемо збирати наступні види інформації:
            </p>
            <ul>
                <li>
                    <strong>Особиста інформація:</strong> Ім'я, електронна пошта, номер телефону та інші дані, які ви надаєте під час реєстрації або зв'язку з нами.
                </li>
                <li>
                    <strong>Технічна інформація:</strong> IP-адреса, тип браузера, операційна система, дані про використання сайту (наприклад, сторінки, які ви відвідуєте).
                </li>
                <li>
                    <strong>Cookies:</strong> Ми використовуємо cookies для покращення роботи сайту та збору аналітичних даних.
                </li>
            </ul>

            <h2>Як ми використовуємо вашу інформацію?</h2>
            <p>
                Ваша інформація може використовуватися для таких цілей:
            </p>
            <ul>
                <li>Надання та покращення наших послуг.</li>
                <li>Відповіді на ваші запити та надання підтримки.</li>
                <li>Надсилання інформаційних повідомлень, якщо ви підписались на наші оновлення.</li>
                <li>Аналізу використання сайту для покращення його функціональності.</li>
            </ul>

            <h2>Як ми захищаємо вашу інформацію?</h2>
            <p>
                Ми вживаємо різних заходів безпеки для захисту вашої особистої інформації, включаючи шифрування даних, регулярні огляди систем безпеки та обмеження доступу до ваших даних.
            </p>

            <h2>Чи передаємо ми інформацію третім сторонам?</h2>
            <p>
                Ми не продаємо, не обмінюємо та не передаємо вашу особисту інформацію третім сторонам без вашого згоди, за винятком випадків, коли це необхідно для надання послуг або виконання законних вимог.
            </p>

            <h2>Ваші права</h2>
            <p>
                Ви маєте право:
            </p>
            <ul>
                <li>Отримати доступ до своїх особистих даних.</li>
                <li>Вимагати виправлення або видалення ваших даних.</li>
                <li>Відмовитися від отримання маркетингових повідомлень.</li>
            </ul>

            <h2>Зміни до політики конфіденційності</h2>
            <p>
                Ми можемо періодично оновлювати цю політику конфіденційності. Будь-ласка, періодично переглядайте цю сторінку, щоб бути в курсі будь-яких змін.
            </p>

            <h2>Як зв'язатися з нами?</h2>
            <p>
                Якщо у вас є питання щодо цієї політики конфіденційності, будь ласка, зв'яжіться з нами через електронну пошту на страниці <a href="../Contact/Contact.jsx">Contact</a>.
            </p>
        </div>
    );
};

export default PrivacyPolicyPage;