import React from 'react';

const CustomMethodsPage = () => {
    return (
        <div className="page-container">
            <h1>Кастомні методи об'єкта</h1>
            <p>
                Методи об'єкта - це функції, які відомі об'єкту та можуть викликатися для виконання певних операцій над об'єктом. Вони дозволяють нам організовувати та виконувати дії, пов'язані з об'єктом, та надають об'єкту його функціональність.
            </p>

            <h2>Використання Методів Об'єкта</h2>
            <p>
                Об'єкти в JavaScript можуть містити не лише дані, але й функції, які називаються методами. Методи - це функції, які виконують дії над даними об'єкта. Давайте розглянемо приклад об'єкта "Автомобіль" з методами:
            </p>
            <pre>
        <code>
          {`
const car = {
  brand: "Toyota",
  model: "Camry",
  year: 2022,
  start: function() {
    console.log("Двигун запущено.");
  },
  stop: function() {
    console.log("Двигун зупинено.");
  },
};

car.start(); // Виведе "Двигун запущено."
car.stop();  // Виведе "Двигун зупинено."
          `}
        </code>
      </pre>
            <p>
                У цьому прикладі <code>start</code> та <code>stop</code> - це методи об'єкта <code>car</code>, які виконують відповідні дії.
            </p>

            <h2>Відмінність Методів Об'єкта від Звичайних Функцій</h2>
            <p>
                Важливою різницею між методами об'єкта та звичайними функціями є те, що методи об'єкта завжди пов'язані з об'єктом, на якому вони були визвані. Це означає, що метод може отримувати доступ до властивостей об'єкта через ключове слово <code>this</code>.
            </p>
            <pre>
        <code>
          {`
const person = {
  firstName: "Василь",
  lastName: "Петров",
  fullName: function() {
    return this.firstName + " " + this.lastName;
  },
};

console.log(person.fullName()); // Виведе "Василь Петров"
          `}
        </code>
      </pre>
            <p>
                У методі <code>fullName</code>, <code>this</code> посилається на об'єкт <code>person</code>, що дозволяє нам отримати доступ до його властивостей.
            </p>
        </div>
    );
};

export default CustomMethodsPage;