import React from 'react';

const ConditionalOperatorsPage = () => {
    return (
        <div className="page-container">
            <h1>Умовний оператор if та тернарний оператор</h1>
            <p>
                Умовний оператор <code>if</code> є однією з фундаментальних конструкцій в мові програмування JavaScript. Він дозволяє виконувати різні частини коду залежно від того, чи виконується певна умова. Тут ми розглянемо синтаксис умовного оператора <code>if</code>, його використання та кілька корисних практичних прикладів.
            </p>
            <p>
                Завдяки йому можна робити розгалуження у коді та змінювати поведінку програми в залежності від умов.
            </p>

            <h2>Синтаксис оператора if</h2>
            <p>
                Основна структура оператора <code>if</code> виглядає наступним чином:
            </p>
            <pre>
        <code>
          {`
if (умова) {
    // Код, що виконується, якщо умова істинна
}
          `}
        </code>
      </pre>
            <p>
                Умова - це вираз або значення, яке перевіряється на істинність. Якщо умова істинна, виконується блок коду всередині фігурних дужок. Якщо умова неправильна, блок коду пропускається.
            </p>

            <h2>Приклади використання</h2>

            <h3>Перевірка числа на парність</h3>
            <pre>
        <code>
          {`
let number = 5;

if (number % 2 === 0) {
    console.log("Число парне.");
} else {
    console.log("Число непарне.");
}
          `}
        </code>
      </pre>
            <p>
                У цьому прикладі ми перевіряємо, чи є число парним, використовуючи оператор <code>%</code>, який повертає залишок від ділення числа на 2. Якщо залишок дорівнює 0, умова виконується, і виводиться "Число парне", в іншому випадку виводиться "Число непарне".
            </p>

            <h3>Визначення старшості</h3>
            <pre>
        <code>
          {`
let age = 18;

if (age < 18) {
    console.log("Ви надто молоді для голосування.");
} else if (age >= 18 && age < 35) {
    console.log("Ви можете голосувати, але ще не можете балотуватися.");
} else {
    console.log("Ви можете голосувати та балотуватися.");
}
          `}
        </code>
      </pre>
            <p>
                У цьому прикладі ми використовуємо <code>if</code>, <code>else if</code> і <code>else</code> для визначення, які права голосу має особа в залежності від її віку. Умови оцінюються в порядку, в якому вони вказані, і виконується перший блок коду, для якого умова істинна.
            </p>

            <h2>Вкладені умовні оператори if</h2>
            <p>
                Умовні оператори можна вкладати один в одного для більш складних перевірок. Ось приклад вкладеного оператора <code>if</code>:
            </p>
            <pre>
        <code>
          {`
let temperature = 25;
let isRaining = false;

if (temperature > 30) {
    console.log("На вулиці жарко.");
    if (isRaining) {
        console.log("Але також йде дощ.");
    }
} else {
    console.log("На вулиці прохолодно.");
}
          `}
        </code>
      </pre>
            <p>
                У цьому прикладі ми перевіряємо температуру та наявність дощу. Якщо температура більше 30 градусів, ми виводимо повідомлення про жару. Якщо при цій умові йде дощ, виводимо також інше повідомлення.
            </p>

            <h2>Тернарний оператор ?</h2>
            <p>
                Тернарний оператор, також відомий як умовний оператор, приймає три операнди і виконує умовну операцію на підставі значення умови. Синтаксис тернарного оператора виглядає так:
            </p>
            <pre>
        <code>
          {`
умова ? вираз1 : вираз2
          `}
        </code>
      </pre>
            <p>
                Якщо умова істинна, то виконується <code>вираз1</code>, інакше - <code>вираз2</code>.
            </p>
            <pre>
        <code>
          {`
let age = 25;

let message = age >= 18 ? 'Доросла людина' : 'Неповнолітній';
          `}
        </code>
      </pre>
            <p>
                У цьому прикладі, якщо вік більше або дорівнює 18, то <code>message</code> буде містити рядок 'Доросла людина', в іншому випадку - 'Неповнолітній'.
            </p>

            <div className='conclusion'>
                <h2>Заключні слова</h2>
                <p>
                    Умовний оператор <code>if</code> - це потужний інструмент в JavaScript, який дозволяє вам створювати
                    логіку у вашому коді на основі умов. Розуміння його синтаксису та правильне використання допоможуть
                    вам писати більш складні та функціональні програми.
                </p>
                <p>
                    Це лише початок вашого шляху до розуміння умовних операторів в JavaScript. Вони є основою багатьох
                    складніших конструкцій, і з їхньою допомогою ви зможете створювати різноманітні програми та
                    веб-додатки. Не соромтеся експериментувати та вдосконалювати свої навички роботи з умовними
                    операторами. Успіхів у вашому навчанні JavaScript!
                </p>
            </div>
        </div>
    );
};

export default ConditionalOperatorsPage;