import React from 'react';

const UserInteractionPage = () => {
    return (
        <div className="page-container">
            <h1>Взаємодія з користувачем через примітивні функції</h1>
            <p>
                Взаємодія з користувачем - важлива частина багатьох веб-додатків. JavaScript пропонує кілька примітивних функцій, які допомагають створити діалогове вікно з користувачем: <code>alert</code>, <code>confirm</code> та <code>prompt</code>. Давайте ми розглянемо, як використовувати ці функції та надати користувачеві можливість взаємодіяти з вашим додатком.
            </p>

            <h2>Функція alert</h2>
            <p>
                Функція <code>alert</code> використовується для відображення повідомлення у спливаючому вікні. Вона часто використовується для повідомлення користувача про певні події чи помилки.
            </p>
            <pre>
        <code>
          {`
alert("Це приклад повідомлення з функцією alert.");
          `}
        </code>
      </pre>

            <h2>Функція confirm</h2>
            <p>
                Функція <code>confirm</code> дозволяє створити підтверджувальне вікно з двома кнопками: "OK" та "Скасувати". Вона повертає <code>true</code>, якщо користувач натиснув "OK", та <code>false</code>, якщо "Скасувати".
            </p>
            <pre>
        <code>
          {`
let result = confirm("Ви впевнені, що хочете видалити цей елемент?");
if (result) {
  // Код для видалення елемента
} else {
  // Код для скасування видалення
}
          `}
        </code>
      </pre>

            <h2>Функція prompt</h2>
            <p>
                Функція <code>prompt</code> використовується для отримання введених користувачем даних. Вона виводить вікно з текстовим полем для введення та кнопками "OK" і "Скасувати". Функція повертає введені дані як рядок.
            </p>
            <pre>
        <code>
          {`
let name = prompt("Будь ласка, введіть ваше ім'я:");
if (name !== null) {
  console.log(\`Вас звати \${name}\`);
} else {
  console.log("Ви скасували введення.");
}
          `}
        </code>
      </pre>
        </div>
    );
};

export default UserInteractionPage;