import React from 'react';
import {Container} from "@mui/material";
import BookHeader from "../../../../features/BookHeader/BookHeader.jsx";
import Paragraph from "../../../../features/Paragraph/Paragraph.jsx";

const FormsAndRegexIntroduction = () => {
    return (
        <Container className="page-container">
            <BookHeader>Вступ</BookHeader>
            <Paragraph>
                Форми є невід'ємною частиною багатьох веб-додатків, і вони дозволяють користувачам вводити та відправляти дані на сервер. Ми розпочнемо з основ створення та обробки форм, включаючи роботу зі звичайними елементами, такими як текстові поля, кнопки та вибір списків.
            </Paragraph>

            <Paragraph>
                Далі ми перейдемо до регулярних виразів, які є потужним інструментом для роботи з текстовими даними. Ви дізнаєтеся, як створювати та використовувати регулярні вирази для пошуку, валідації та маніпуляції текстовими рядками. Ми розглянемо основні концепції, синтаксис та функції, які допоможуть вам ефективно взаємодіяти з рядками даних.
            </Paragraph>

            <Paragraph>
                Завершимо тему, вивчивши практичні аспекти роботи з формами та регулярними виразами в реальних проектах. Ви навчитесь валідувати введені дані у форми, фільтрувати та обробляти текстові дані та створювати корисні функції для роботи з рядками.
            </Paragraph>
        </Container>
    );
};

export default FormsAndRegexIntroduction;