import React from 'react';

const AdvancedFunctionsIntroPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                На цьому занятті ми глибоко дослідимо концепції, які визначають особливості функцій в JavaScript.
            </p>
            <p>
                Починаючи з концепції замикання, ми розглянемо, як функції можуть зберігати свій контекст виклику та використовувати замкнуті змінні. Далі розглянемо функції-коллбеки та функції вищого порядку, які дозволяють нам працювати з функціями як з об'єктами першого класу.
            </p>
            <p>
                Закріпимо отримані знання, вивчивши функції, що самовизиваються (IIFE), та їх роль у визначенні простору імен.
            </p>
            <p>
                У кінці заняття ми вивчимо концепцію рекурсії та її застосування в JavaScript. Рекурсивні функції можуть бути потужним інструментом для обробки завдань, які вимагають повторюваної логіки.
            </p>
        </div>
    );
};

export default AdvancedFunctionsIntroPage;