import React from 'react';

const EventBubblingPage = () => {
    return (
        <div className="page-container">
            <h1>Спливання подій (Event Bubbling)</h1>
            <p>
                Спливання подій - це аспект подій в DOM (Document Object Model), який означає, що події можуть поширюватися вгору по ієрархії елементів DOM після того, як вони були спровоковані. Це означає, що коли ви викликаєте подію на конкретному елементі, ця подія також буде спровокована на всіх його батьківських елементах відповідно до їх ієрархії. Спливання подій дозволяє реагувати на події на різних рівнях DOM-дерева без необхідності призначення обробників подій для кожного елемента окремо.
            </p>

            <h2>Для чого це важливо?</h2>
            <p>
                Спливання подій важливо, оскільки воно дозволяє створювати більш гнучкі та підтримувані веб-додатки. Деякі з основних переваг спливання подій включають:
            </p>
            <ul>
                <li>
                    <strong>Доступність для різних рівнів DOM</strong>: Ви можете встановити обробник подій на вищому рівні DOM, і він автоматично буде спрацьовувати для всіх дочірніх елементів, які генерують цю подію. Це спрощує роботу з подіями на багатьох елементах.
                </li>
                <li>
                    <strong>Зменшення дублювання коду</strong>: За допомогою спливання подій вам не потрібно додавати обробники подій до кожного окремого елемента, що має однакову функціональність. Це зменшує дублювання коду і полегшує підтримку.
                </li>
                <li>
                    <strong>Можливість зупинити спливання</strong>: Ви можете зупинити спливання події на будь-якому етапі, якщо ви хочете завершити подальше поширення події. Це дозволяє керувати, де саме відбудеться обробка події.
                </li>
            </ul>

            <h2>Фази подій</h2>
            <p>
                Фази подій - це концепція, що описує порядок, в якому події розгортаються та обробляються в браузері. Існують три основні фази подій: фаза захоплення (capture phase), фаза цільового об'єкта (target phase) і фаза спливання (bubbling phase).
            </p>

            <h3>Фаза захоплення (Capture Phase)</h3>
            <p>
                Фаза захоплення - це перша фаза розгортання подій, коли подія спускається вниз від кореня DOM-дерева до цільового елемента. Під час фази захоплення обробники подій викликаються в порядку від найвищого рівня предка до цільового елемента. Проте важливо враховувати, що не всі типи подій підтримують фазу захоплення.
            </p>

            <h3>Фаза цільового об'єкта (Target Phase)</h3>
            <p>
                Фаза цільового об'єкта відбувається, коли подія досягає цільового елемента, на якому вона була спровокована. На цьому етапі обробник подій викликається на самому цільовому елементі.
            </p>

            <h3>Фаза спливання (Bubbling Phase)</h3>
            <p>
                Фаза спливання - це остання фаза розгортання подій, коли подія починає підніматися вгору від цільового елемента до кореня DOM-дерева. Під час фази спливання обробники подій викликаються в порядку від цільового елемента до найвищого рівня предка. Більшість типів подій підтримують фазу спливання.
            </p>
        </div>
    );
};

export default EventBubblingPage;