import React from 'react';

const DataTypesPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                Ви дізнаєтеся про різні типи даних, які використовуються в мові програмування JavaScript, та їхню роль у вашому коді.
            </p>
            <p>
                Спочатку ви розглянете базові примітивні типи даних, такі як числа, рядки, булеві значення та <code>null</code>. Ви навчитеся створювати та операціювати змінними, що містять ці примітивні типи даних. Ви також розглянете різницю між змінними, що мають значення, та тими, що посилаються на об'єкти.
            </p>
            <p>
                Ця тема також включає важливі поняття, такі як приведення типів, динамічна типізація та операції порівняння типів даних у JavaScript. Ви будете готові до вирішення різних завдань, де важливо правильно керувати типами даних у вашому коді.
            </p>
        </div>
    );
};

export default DataTypesPage;