import React from 'react';

const FunctionalProgrammingIntroPage = () => {
    return (
        <div className="page-container">
            <h1>Вступ</h1>
            <p>
                Зануримося в захопливий світ функціонального програмування в JavaScript. Спочатку ми ознайомимося з основами роботи з функціями, які є одними з ключових будівельних блоків мови. Ми розглянемо різні способи створення функцій та їхні варіанти, включаючи анонімні та іменовані функції.
            </p>
            <p>
                Далі ми детально розглянемо параметри функцій та можливість задавати значення за промовчанням для параметрів. Ми вивчимо, як передавати параметри в функції та як працює область видимості змінних в функціях. Також ви дізнаєтеся про псевдо-масив <code>arguments</code> та як використовувати його для роботи з параметрами функцій.
            </p>
            <p>
                Особливу увагу приділимо поверненню значень з функцій та відмінностям між звичайними функціями та стрілочними функціями. Ми також розглянемо концепції замикання, функцій-коллбеків, функцій вищого порядку та функцій, що самовизиваються (IIFE). У кінці теми ви дізнаєтеся про рекурсію та її застосування в JavaScript.
            </p>
        </div>
    );
};

export default FunctionalProgrammingIntroPage;